Fullmoon12185/stm32ebox/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "stm32f1xx_nucleo.h"

#include "stdio.h"
#include "string.h"


///* Private function prototypes -----------------------------------------------*/
//#ifdef __GNUC__
///* With GCC, small printf (option LD Linker->Libraries->Small printf
//   set to 'Yes') calls __io_putchar() */
//#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
//#else
//#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
//#endif /* __GNUC__ */

typedef enum
{
  ABNORMAL = 0,
  NORMAL = !ABNORMAL
} WorkingStatus;

#define DEBUG_INIT(X) 					X


/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* Private defines -----------------------------------------------------------*/
#define 	BOX_AT_SHOW_ROOM			0
#define 	BOX_AT_XI					1
#define	    BOX_GENERAL					2

#define		BOX_WITH_6_OUTLETS			3

#define		BOX_PLACE					BOX_GENERAL

#define		ESTOP_BUTTON				1

#define   VERSION_3_WITH_ALL_CT_5A       3
#define   VERSION_4_WITH_8CT_5A_2CT_10A  4
#define   VERSION_5_WITH_8CT_10A_2CT_20A 5

#define   VERSION_6_WITH_8CT_20A		 6

//Please turn on this one if want to make a test box
#define		VERSION_TEST_EBOX			VERSION_3_WITH_ALL_CT_5A

#define		VERSION_EBOX				VERSION_6_WITH_8CT_20A


#define		CITIHOME_39						39

#define		B3_HOAKHANH_116					116
#define		NETHOME_117						117
#define		NETHOME_118						118
#define		TOPAZ_119						119
#define		TOPAZ_120						120
#define		KINGDOM_121						121

#define		N1_HOAKHANH_124					124

#define		HDMON_1_126						126
#define		HDMON_2_127						127
#define 	ESTELLA_HEIGHTS_129				129

#define 	PHU_DONG_PREMIER_132			132
#define		LINHTAY_139						139
#define 	HAUSINCO_142					142

#define 	BRIDGEVIEW_143					143
#define		PETRO_LANDMARK_154				154
#define 	HAI_THANH_159					159

#define		ANTRUNG_BUILDING_161			161

#define		PHU_MY_175						175
#define		HIMLAM_PHU_DONG_176				176
#define		EBOOST_OFFICE_177				177
#define		PARKVIEW_179					179

#define		WESTERN_CAPITAL_193				193
#define		VAN_DO_196						196
#define		CHUONG_DUONG_HOME_197			197
#define 	HUNG_VUONG_1_198				198

#define		N4_HOA_KHANH_204 				204
#define		HIM_LAM_RIVER_SIDE_207 			207
#define		CHARM_PLAZA_208					208

#define		MY_PHUC_1_209					209
#define		RIVIERA_POINT_213 				213
#define		THU_THIEM_GREEN_HOUSE_221		221
#define		PEGASUS_BIENHOA_222 			222

#define		RICHMOND_236					236
#define		RICHMOND_237					237
#define		CITISOHO_240					240


#define		N1_HOAKHANH_2_260				260
#define		LUXCITY_277						277

#define 	PHU_DONG_SKY_GARDEN_282			282
#define		DIAMOND_LOTUS_RIVERSIDE_285		285

#define		MY_PHUC_2_255					255
#define	    LOVERA_VISTA_293				293


#define		PHU_MY_BLOCK_B_244				244
#define		THOI_AN_1_299					299
#define		THOI_AN_2_300 			        300
#define		VINAPHARM_311					311
#define		MY_PHUC_3_319 			        319
#define		MY_PHUC_4_320 			        320
#define		EHOME_3_TAY_SAI_GON_322			322
#define 	PRECIA_325						325
#define 	TARA_327						327
#define 	TARA_328						328

#define		THE_LIGHT_1_333					333
#define		HOANG_ANH_2_336					336

#define     VO_DINH_338						338
#define 	PHU_MY_THUAN_341				341
#define 	HOANG_ANH_THANH_BINH_346		346
#define 	PHUC_YEN_347					347

#define 	HIM_LAM_PHU_DONG_348			348
#define		BINH_KHANH_349					349


#define 	BEEP_ON							1

/*
 * Firmware Chosen
 */
#define FOTA_FIRMWARE_CHOOSEN		0
#define FACTORY_FIRMWARE_CHOOSEN	1
#define CURRENT_FIRMWARE_CHOOSEN	2
/*
 * Update Firmware Status
 */
#define UPDATE_SUCCESS				0
#define UPDATE_FAILED				1
#define DONT_UPDATE					0xFF
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
#define BOOTLOADER_FIRMWARE_ADDR	0x08000000			// Address of Bootloader Firmware
#define FACTORY_FIRMWARE_ADDR		0x08005000			// Bootloader have 20KBytes from 0x08000000
#define FOTA_FIRMWARE_ADDR			0x0801E000			// Factory have 100KBytes from 0x08005800
#define CURRENT_FIRMWARE_ADDR		0x08040000			// FOTA have 50Kbytes from 0x0801E000
#define FIRMWARE_CHOOSEN			0x08060000			// Address for choose what firmware MCU will run
#define FACTORY_VERSION_ADDR		0x08070000			// Address contain FACTORY Firmware Version
#define CURRENT_VERSION_ADDR		0x08075000			// Address contain CURRENT Firmware Version
#define UPDATE_STATUS_ADDR			0x08076000			// Address contain FACTORY Firmware Version



#define   CT_10A_1                        8
#define   CT_10A_2                        9

#if(VERSION_EBOX == VERSION_4_WITH_8CT_5A_2CT_10A)
	#define   CT_10A_1                        8
	#define   CT_10A_2                        9
#elif(VERSION_EBOX == VERSION_5_WITH_8CT_10A_2CT_20A)
	#define   CT_20A_1                        0
	#define   CT_20A_2                        1

	#define   CT_10A_FILTER_1                        4
	#define   CT_10A_FILTER_2                        5

#endif

#define   VOLTAGE_USAGE       			228
#define		INTERRUPT_TIMER_PERIOD		10 //ms
#define		WATCHDOG_ENABLE 			1

#if (VERSION_EBOX == 1)
    #define		SIM5320	    				1
#elif (VERSION_EBOX == 15)
    #define		SIM5320	    				1
#elif(VERSION_EBOX == 2 || VERSION_EBOX == 3 || VERSION_EBOX == VERSION_4_WITH_8CT_5A_2CT_10A)
    #define		SIM7600						1
#elif(VERSION_EBOX == VERSION_5_WITH_8CT_10A_2CT_20A)
    #define		SIM7600						1
#elif(VERSION_EBOX == VERSION_6_WITH_8CT_20A)
    #define		SIM7600						1

#endif

//estop
#if(ESTOP_BUTTON == 1)
	#define ESTOP_PIN 							GPIO_PIN_13
	#define ESTOP_PORT 							GPIOC

#endif


#define LED2_PIN                         GPIO_PIN_2
#define LED2_GPIO_PORT                   GPIOB


//LED output control signals
#define LED_SDI							GPIO_PIN_6
#define LED_SDI_PORT					GPIOC
#define LED_SCK							GPIO_PIN_3
#define LED_SCK_PORT					GPIOC
#define LED_LE							GPIO_PIN_4
#define LED_LE_PORT						GPIOC
#define LED_OE							GPIO_PIN_5
#define LED_OE_PORT						GPIOC

//BUZZER
#define PB5_BUZZER_PIN					GPIO_PIN_5
#define PB5_BUZZER_PORT					GPIOB
#define BUZZER_PIN						PB5_BUZZER_PIN
#define BUZZER_PORT						PB5_BUZZER_PORT

//SPI CS pin
#define SPI_CS_PIN						GPIO_PIN_12
#define SPI_CS_PORT						GPIOB

//3G control signals pins ports
#if(VERSION_EBOX == 1)
  #define PC7_3G_WAKEUP					GPIO_PIN_7
  #define PC7_3G_WAKEUP_PORT				GPIOC

#elif(VERSION_EBOX == 15)
  #define PC7_3G_WAKEUP					GPIO_PIN_7
  #define PC7_3G_WAKEUP_PORT				GPIOC
#endif

#define PC8_3G_PWRON					GPIO_PIN_8
#define PC8_3G_PWRON_PORT				GPIOC
#define PC9_3G_PERST					GPIO_PIN_9
#define PC9_3G_PERST_PORT				GPIOC
#define PA8_3G_REG_EN					GPIO_PIN_8
#define PA8_3G_REG_EN_PORT				GPIOA

#if(VERSION_EBOX == 1)
#define SIM5320_3G_WAKEUP					PC7_3G_WAKEUP
#define SIM5320_3G_WAKEUP_PORT				PC7_3G_WAKEUP_PORT
#elif(VERSION_EBOX == 15)
#define SIM5320_3G_WAKEUP					PC7_3G_WAKEUP
#define SIM5320_3G_WAKEUP_PORT				PC7_3G_WAKEUP_PORT
#endif

#define SIM5320_3G_PWRON					PC8_3G_PWRON
#define SIM5320_3G_PWRON_PORT				PC8_3G_PWRON_PORT
#define SIM5320_3G_PERST					PC9_3G_PERST
#define SIM5320_3G_PERST_PORT				PC9_3G_PERST_PORT
#define SIM5320_3G_REG_EN					PA8_3G_REG_EN
#define SIM5320_3G_REG_EN_PORT				PA8_3G_REG_EN_PORT

//timer
#define TIMx                           TIM3
#define TIMx_CLK_ENABLE()              __HAL_RCC_TIM3_CLK_ENABLE()


/* Definition for TIMx's NVIC */
#define TIMx_IRQn                      TIM3_IRQn
#define TIMx_IRQHandler                TIM3_IRQHandler



/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* User can use this section to tailor USARTx/UARTx instance used and associated
   resources */
/* Definition for USARTx clock resources */
#define USART1_CLK_ENABLE()              __HAL_RCC_USART1_CLK_ENABLE();
#define DMA1_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
#define USART1_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
#define USART1_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()

#define USART1_FORCE_RESET()             __HAL_RCC_USART1_FORCE_RESET()
#define USART1_RELEASE_RESET()           __HAL_RCC_USART1_RELEASE_RESET()

/* Definition for USARTx Pins */
#define USART1_TX_PIN                    GPIO_PIN_9
#define USART1_TX_GPIO_PORT              GPIOA
#define USART1_RX_PIN                    GPIO_PIN_10
#define USART1_RX_GPIO_PORT              GPIOA




/* Exported macro ------------------------------------------------------------*/
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
/* Size of Trasmission buffer */
#define TXBUFFERSIZE                      (COUNTOF(aTxBuffer) - 1)
/* Size of Reception buffer */
#define RXBUFFERSIZE                      250




#define USART2_TX_PIN 					GPIO_PIN_2
#define USART2_TX_GPIO_PORT 				GPIOA
#define USART2_RX_PIN 					GPIO_PIN_3
#define USART2_RX_GPIO_PORT 				GPIOA

#define USART2_CLK_ENABLE()              		__HAL_RCC_USART2_CLK_ENABLE();
#define DMA2_CLK_ENABLE()                		__HAL_RCC_DMA2_CLK_ENABLE()
#define USART2_RX_GPIO_CLK_ENABLE()      		__HAL_RCC_GPIOA_CLK_ENABLE()
#define USART2_TX_GPIO_CLK_ENABLE()      		__HAL_RCC_GPIOA_CLK_ENABLE()

#define USART2_FORCE_RESET()             		__HAL_RCC_USART2_FORCE_RESET()
#define USART2_RELEASE_RESET()           		__HAL_RCC_USART2_RELEASE_RESET()

///////////////////////////////////////////////////////////////////////////////
#define USART3_TX_PIN 							GPIO_PIN_10
#define USART3_TX_GPIO_PORT 					GPIOB
#define USART3_RX_PIN 							GPIO_PIN_11
#define USART3_RX_GPIO_PORT 					GPIOB

#define USART3_CLK_ENABLE()              		__HAL_RCC_USART3_CLK_ENABLE();
#define DMA3_CLK_ENABLE()                		__HAL_RCC_DMA3_CLK_ENABLE()
#define USART3_RX_GPIO_CLK_ENABLE()      		__HAL_RCC_GPIOB_CLK_ENABLE()
#define USART3_TX_GPIO_CLK_ENABLE()      		__HAL_RCC_GPIOB_CLK_ENABLE()

#define USART3_FORCE_RESET()             		__HAL_RCC_USART3_FORCE_RESET()
#define USART3_RELEASE_RESET()           		__HAL_RCC_USART3_RELEASE_RESET()


#define UART5_TX_PIN 					GPIO_PIN_12
#define UART5_TX_GPIO_PORT 				GPIOC
#define UART5_RX_PIN 					GPIO_PIN_2
#define UART5_RX_GPIO_PORT 				GPIOD

#define UART5_CLK_ENABLE()              __HAL_RCC_UART5_CLK_ENABLE();
#define UART5_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
#define UART5_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOD_CLK_ENABLE()

#define UART5_FORCE_RESET()             __HAL_RCC_UART5_FORCE_RESET()
#define UART5_RELEASE_RESET()           __HAL_RCC_UART5_RELEASE_RESET()


#if(VERSION_EBOX != VERSION_6_WITH_8CT_20A)
	#define		SAMPLE_STEPS							2
	#define 	NUMBER_OF_SAMPLES_PER_AVERAGE			(1 << SAMPLE_STEPS)
	#define 	NUMBER_OF_SAMPLES_PER_SECOND			275
	#define 	NUMBER_OF_ADC_CHANNELS					14
#else

	#define		SAMPLE_STEPS							2
	#define 	NUMBER_OF_SAMPLES_PER_AVERAGE			(1 << SAMPLE_STEPS)
	#define 	NUMBER_OF_SAMPLES_PER_SECOND			275
	#define 	NUMBER_OF_ADC_CHANNELS					12
#endif

#if(VERSION_EBOX == 2 || VERSION_EBOX == 3 || VERSION_EBOX == VERSION_4_WITH_8CT_5A_2CT_10A || VERSION_EBOX == VERSION_5_WITH_8CT_10A_2CT_20A)
#define 	ZERO_POINT_DETECTION_PIN				GPIO_PIN_7
#define 	ZERO_POINT_DETECTION_PORT				GPIOC
#elif(VERSION_EBOX == VERSION_6_WITH_8CT_20A)
#define 	ZERO_POINT_DETECTION_PIN				GPIO_PIN_7
#define 	ZERO_POINT_DETECTION_PORT				GPIOC
#elif(VERSION_EBOX == 15)
#define 	ZERO_POINT_DETECTION_PIN				GPIO_PIN_7
#define 	ZERO_POINT_DETECTION_PORT				GPIOC
#elif(VERSION_EBOX == 1)
#define 	ZERO_POINT_DETECTION_PIN				GPIO_PIN_14
#define 	ZERO_POINT_DETECTION_PORT				GPIOC
#endif

//SPI2
#define MASTER_BOARD
#define SPI2_CLK_ENABLE()                __HAL_RCC_SPI2_CLK_ENABLE()
#define SPI2_SCK_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOB_CLK_ENABLE()
#define SPI2_MISO_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define SPI2_MOSI_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()

/* Definition for SPIx Pins */
#define SPI2_NSS_PIN                     GPIO_PIN_12
#define SPI2_NSS_GPIO_PORT               GPIOB

#define SPI2_SCK_PIN                     GPIO_PIN_13
#define SPI2_SCK_GPIO_PORT               GPIOB
#define SPI2_MISO_PIN                    GPIO_PIN_14
#define SPI2_MISO_GPIO_PORT              GPIOB
#define SPI2_MOSI_PIN                    GPIO_PIN_15
#define SPI2_MOSI_GPIO_PORT              GPIOB




//I2C
#define I2C1_CLK_ENABLE()               __HAL_RCC_I2C1_CLK_ENABLE()
#define I2C1_SDA_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define I2C1_SCL_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()

#define I2C1_FORCE_RESET()              __HAL_RCC_I2C1_FORCE_RESET()
#define I2C1_RELEASE_RESET()            __HAL_RCC_I2C1_RELEASE_RESET()

/* Definition for I2Cx Pins */
#define I2C1_SCL_PIN                    GPIO_PIN_6
#define I2C1_SCL_GPIO_PORT              GPIOB
#define I2C1_SDA_PIN                    GPIO_PIN_7
#define I2C1_SDA_GPIO_PORT              GPIOB




//pcf8574 inputs
#define I2C_BUFFERSIZE 		1
#define I2C_ADDRESS_GPIO0	0
#define I2C_ADDRESS_GPIO1	4
#define I2C_ADDRESS_GPIO2	6

#define SAC10				0
#define SAC20				1
#define SAC11				2
#define SAC21				3
#define SAC12				4
#define SAC22				5
#define SAC13				6
#define SAC23				7
#define SAC14				8
#define SAC24				9
#define SAC15				10
#define SAC25				11
#define SAC16				12
#define SAC26				13
#define SAC17				14
#define SAC27				15
#define SAC18				16
#define SAC28				17
#define SAC19				18
#define SAC29				19



#if(VERSION_EBOX == 2 || VERSION_EBOX == 3 || VERSION_EBOX == VERSION_4_WITH_8CT_5A_2CT_10A || VERSION_EBOX == VERSION_5_WITH_8CT_10A_2CT_20A)

//Relay
#define	NUMBER_OF_RELAYS				10
#define RELAY_0							0
#define RELAY_1							1
#define RELAY_2							2
#define RELAY_3							3
#define RELAY_4							4
#define RELAY_5							5
#define RELAY_6							6
#define RELAY_7							7
#define RELAY_8							8
#define RELAY_9				      		9

//Relay control pins and ports
#define PA11_OUT0							GPIO_PIN_11
#define PA11_OUT0_PORT						GPIOA
#define PA12_OUT1							GPIO_PIN_12
#define PA12_OUT1_PORT						GPIOA
#define PB8_OUT2							GPIO_PIN_8
#define PB8_OUT2_PORT						GPIOB
#define PB9_OUT3							GPIO_PIN_9
#define PB9_OUT3_PORT						GPIOB
#define PA15_OUT4							GPIO_PIN_15
#define PA15_OUT4_PORT						GPIOA

#if(VERSION_EBOX == VERSION_5_WITH_8CT_10A_2CT_20A)
	#define PC10_OUT5							GPIO_PIN_14
	#define PC10_OUT5_PORT						GPIOC
	#define PC11_OUT6							GPIO_PIN_15
	#define PC11_OUT6_PORT						GPIOC
#else
	#define PC10_OUT5							GPIO_PIN_10
	#define PC10_OUT5_PORT						GPIOC
	#define PC11_OUT6							GPIO_PIN_11
	#define PC11_OUT6_PORT						GPIOC
#endif

#define PC12_OUT7								GPIO_PIN_12
#define PC12_OUT7_PORT							GPIOC

#define PB3_OUT8								GPIO_PIN_3
#define PB3_OUT8_PORT							GPIOB

#define PB4_OUT9								GPIO_PIN_4
#define PB4_OUT9_PORT							GPIOB




	#define RELAY_PIN_0							PA11_OUT0
	#define RELAY_PIN_1							PA12_OUT1
	#define RELAY_PIN_2							PB8_OUT2
	#define RELAY_PIN_3							PB9_OUT3
	#define RELAY_PIN_4							PA15_OUT4
	#define RELAY_PIN_5							PC10_OUT5
	#define RELAY_PIN_6							PC11_OUT6
	#define RELAY_PIN_7							PC12_OUT7
	#define RELAY_PIN_8							PB3_OUT8
	#define RELAY_PIN_9							PB4_OUT9

	#define RELAY_PORT_0						PA11_OUT0_PORT
	#define RELAY_PORT_1						PA12_OUT1_PORT
	#define RELAY_PORT_2						PB8_OUT2_PORT
	#define RELAY_PORT_3						PB9_OUT3_PORT
	#define RELAY_PORT_4						PA15_OUT4_PORT
	#define RELAY_PORT_5						PC10_OUT5_PORT
	#define RELAY_PORT_6						PC11_OUT6_PORT
	#define RELAY_PORT_7						PC12_OUT7_PORT
	#define RELAY_PORT_8						PB3_OUT8_PORT
	#define RELAY_PORT_9						PB4_OUT9_PORT

#elif(VERSION_EBOX == VERSION_6_WITH_8CT_20A)
//Relay
#define	NUMBER_OF_RELAYS				8

#define RELAY_0							0
#define RELAY_1							1
#define RELAY_2							2
#define RELAY_3							3
#define RELAY_4							4
#define RELAY_5							5
#define RELAY_6							6
#define RELAY_7							7

//Relay control pins and ports
#define PA11_OUT0							GPIO_PIN_11
#define PA11_OUT0_PORT						GPIOA
#define PA12_OUT1							GPIO_PIN_12
#define PA12_OUT1_PORT						GPIOA
#define PB8_OUT2							GPIO_PIN_8
#define PB8_OUT2_PORT						GPIOB
#define PB9_OUT3							GPIO_PIN_9
#define PB9_OUT3_PORT						GPIOB
#define PA15_OUT4							GPIO_PIN_15
#define PA15_OUT4_PORT						GPIOA

#define PC10_OUT5							GPIO_PIN_3
#define PC10_OUT5_PORT						GPIOB
#define PC11_OUT6							GPIO_PIN_4
#define PC11_OUT6_PORT						GPIOB


#define PC12_OUT7								GPIO_PIN_0
#define PC12_OUT7_PORT							GPIOB

//#define PB3_OUT8								GPIO_PIN_3
//#define PB3_OUT8_PORT							GPIOB
//
//#define PB4_OUT9								GPIO_PIN_4
//#define PB4_OUT9_PORT							GPIOB




	#define RELAY_PIN_0							PA11_OUT0
	#define RELAY_PIN_1							PA12_OUT1
	#define RELAY_PIN_2							PB8_OUT2
	#define RELAY_PIN_3							PB9_OUT3
	#define RELAY_PIN_4							PA15_OUT4
	#define RELAY_PIN_5							PC10_OUT5
	#define RELAY_PIN_6							PC11_OUT6
	#define RELAY_PIN_7							PC12_OUT7
//	#define RELAY_PIN_8							PB3_OUT8
//	#define RELAY_PIN_9							PB4_OUT9

	#define RELAY_PORT_0						PA11_OUT0_PORT
	#define RELAY_PORT_1						PA12_OUT1_PORT
	#define RELAY_PORT_2						PB8_OUT2_PORT
	#define RELAY_PORT_3						PB9_OUT3_PORT
	#define RELAY_PORT_4						PA15_OUT4_PORT
	#define RELAY_PORT_5						PC10_OUT5_PORT
	#define RELAY_PORT_6						PC11_OUT6_PORT
	#define RELAY_PORT_7						PC12_OUT7_PORT
//	#define RELAY_PORT_8						PB3_OUT8_PORT
//	#define RELAY_PORT_9						PB4_OUT9_PORT


#endif



#if(VERSION_EBOX == 2 || VERSION_EBOX == 3 || VERSION_EBOX == VERSION_4_WITH_8CT_5A_2CT_10A || VERSION_EBOX == VERSION_5_WITH_8CT_10A_2CT_20A)
#define PD2_RELAY_ENABLE_PIN						GPIO_PIN_2
#define PD2_RELAY_ENABLE_PORT						GPIOD

#elif(VERSION_EBOX == VERSION_6_WITH_8CT_20A)
#define PD2_RELAY_ENABLE_PIN						GPIO_PIN_1
#define PD2_RELAY_ENABLE_PORT						GPIOB

#endif

#if(VERSION_EBOX == 15)
#define PD2_RELAY_ENABLE_PIN						           GPIO_PIN_2
#define PD2_RELAY_ENABLE_PORT						           GPIOD
#endif


#define		NUMBER_OF_SUBSCRIBE_TOPIC							3
#define		NUMBER_OF_PUBLISH_TOPIC								2
#define 	MAX_TOPIC_LENGTH									14

#define 	SUBSCRIBE_RECEIVE_MESSAGE_TYPE 						48
#define		DATA_RECEIVE_LENGTH									15
#define 	LEN_SUBSCRIBE_RECEIVE_MESSAGE_TYPE1 				15
#define 	LEN_SUBSCRIBE_RECEIVE_MESSAGE_TYPE2 				17
#define 	LEN_SUBSCRIBE_RECEIVE_MESSAGE_FOTA					14 // '0x'

#define		COMMAND_SENDING_SMS_MESSAGE		     				's'

#define 	LEN_FOR_UPDATE_POWER_CONSUPMPTION 				    24


#define 	SUBSCRIBE_RECEIVE_RETAINED_MESSAGE_TYPE				49
#define		DATA_RETAINED_MESSAGE_LENGTH						51
#define 	LEN_SUBSCRIBE_RECEIVE_RETAINED_MESSAGE_TYPE			51


#define		NUMBER_OF_ADC_CHANNELS_FOR_POWER_CALCULATION	    (NUMBER_OF_RELAYS + 1)
#define		MAIN_INPUT										    (NUMBER_OF_ADC_CHANNELS_FOR_POWER_CALCULATION - 1)

#define		POWER_CONSUMPTION_OF_MCU						    6

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
